#### Terraform Plan Summary 📝

<details><summary>Show Plan Summary</summary>

```
  + create
  # aws_iam_role.external-admin will be created
  + resource "aws_iam_role" "external-admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::495599766789:user/k8s-admin"
                      + Sid       = ""
              + Version   = "2012-10-17"
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-admin"
      + name_prefix           = (known after apply)
```

</details>

Full plan details are available in the [plan output artifact](https://github.com/iamfet/eks-secure-infra-automation/actions/runs/15616249849).

*Pushed by: @iamfet, Action: `pull_request`*